const WebSocket = require('ws');
const { speechToText } = require('./src/speech-to-text');
const { azureOpenAIChat } = require('./src/openai-chat');
// const { textToSpeech } = require('./src/text-to-speech');
const { textToSpeech } = require('./src/text-to-speech-streamoutput');
const { splitSection } = require('./src/split-section');
const { compareSimilarText } = require('./src/openai-embedding');
const { Readable } = require('stream');
const ffmpeg = require('fluent-ffmpeg');
const ffmpegInstaller = require('@ffmpeg-installer/ffmpeg');
const { PassThrough } = require('stream');
const fs = require('fs').promises;
const path = require('path');
const { testScript1, testScript2, testScript3, testScript4 } = require("./bestScript");
require('dotenv').config();

const testData = [
  "สวัสดีค่ะ คุณ ก ใช่ไหมคะ",
  "วันนี้โทรมาแนะนำโปรโมชั่นประกันภัยรถยนต์ดีๆ ที่คุณไม่ควรพลาดค่ะ?",
  "ทางเรามีประกันภัยชั้น 1 สำหรับรถของคุณ ตอนนี้บริษัทมีแผนที่ผ่อนได้ 0% นานสูงสุด 10 งวด บางเจ้ารับผ่อนผ่านบัตรเดบิตได้ด้วย ไม่ต้องมีบัตรเครดิตครับ เบี้ยก็ไม่แรง เริ่มต้นราว 13,000–14,000 บาทต่อปี",
  "ตัวนี้เคลมได้ทุกกรณีที่ไม่ใช่จงใจค่ะ ไม่ว่าจะเฉี่ยวขอบฟุตปาธ โดนมอเตอร์ไซค์เฉี่ยว หรือแม้แต่รอยขีดจากการจอดใกล้ตลาด ประกันก็เคลมให้ค่ะ เรียกเจ้าหน้าที่มาถึงที่เลย หรือถ้าพี่ไม่สะดวกก็มีเคลมนัดหน้าบ้านค่ะ",
  "ได้เลยค่ะ ไม่มีปัญหา แล้วจะส่งรายละเอียดให้ทาง line เพื่อให้คุณพิจารณาได้สะดวกค่ะ",
  "ประกันชั้น 1 เคลมได้ทุกกรณีแม้ไม่ผิด และมีเจ้าหน้าที่มาถึงที่",
  "ตอนนี้มีแผนผ่อน 0% 10 เดือนครับ ไม่ต้องใช้บัตรเครดิตก็ผ่อนได้",
  "เอกสารก็ง่ายมากครับ ส่งผ่านไลน์ แล้วเจ้าหน้าที่นัดตรวจรถที่บ้าน",
  "ถ้าพี่สนใจ เดี๋ยวผมเช็กราคาให้ฟรีครับ",
  "ขอบคุณค่ะ ขอให้มีความสุขในวันนี้นะคะ สวัสดีค่ะ"
];

const testData1 = [
  "สวัสดีครับพี่ เห็นว่าพี่เพิ่งออกรถใหม่ใช่ไหมครับ รถสวยมากเลยครับ",
  "ไม่ทราบว่าตอนนี้ได้ทำประกันรถไว้หรือยังครับ?",
  "อ๋อ เข้าใจเลยครับ รถใหม่หลายคนก็ยังลังเลเรื่องประกัน",
  "แต่ช่วงนี้อุบัติเหตุเฉี่ยวชนบ่อยครับ ประกันชั้น 1 จะช่วยดูแลพี่ได้ดีที่สุด",
  "ถึงพี่จะขับแค่ในเมือง แต่รถคันอื่นอาจไม่ระวัง",
  "ประกันชั้น 1 เคลมได้ทุกกรณีแม้ไม่ผิด และมีเจ้าหน้าที่มาถึงที่",
  "ตอนนี้มีแผนผ่อน 0% 10 เดือนครับ ไม่ต้องใช้บัตรเครดิตก็ผ่อนได้",
  "เอกสารก็ง่ายมากครับ ส่งผ่านไลน์ แล้วเจ้าหน้าที่นัดตรวจรถที่บ้าน",
  "ถ้าพี่สนใจ เดี๋ยวผมเช็กราคาให้ฟรีครับ",
  "แค่บอกรุ่นรถ ยี่ห้อ ปีจดทะเบียน แล้วเดี๋ยวผมส่งราคาให้เปรียบเทียบ 2-3 บริษัทครับ"
];

  (async () => {
    const result = await splitSection(testData1, testScript4);
    console.log(result); // Output: section ที่ข้อความถูกจัดให้อยู่
  })();